{
    "alarms": [
        {
            "index": 1000,
            "cause": "SOFTWARE_ERROR",
            "name": "SPROUT_PROCESS_FAIL",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Sprout process has been restored to normal operation.",
                    "description": "Sprout: Process failure cleared.",
                    "cause": "The local Sprout process has been restored to normal operation. The previously issued alarm has been cleared.",
                    "effect": "The Sprout process is functioning normally again.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "Monit has detected that the local Sprout process has failed. A restart will automatically be attempted. If this alarm does not clear, the Sprout process may have been stopped or an unrecoverable failure may have occurred.",
                    "description": "Sprout: Process failure.",
                    "cause": "The system has detected that the Sprout process has failed.",
                    "effect": "In progress I-CSCF, S-CSCF and BGCF SIP transactions are interrupted and SIP clients may be required to retransmit them. If only a small percentage of Sprout processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in SIP processing capacity and will eventually result in service impacts. If all Sprout instances are failed then all future SIP registrations and call attemps will fail until such time as one or more Sprout instances recover.",
                    "action": "Monitor for the alarm to clear and confirm the system is operating normally. If the failed Sprout process fails to return to service then contact your support representative."
                }
            ]
        },
        {
            "index": 1001,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_HOMESTEAD_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Sprout process and the Homestead service has been restored.",
                    "description": "Sprout: Homestead communication error cleared.",
                    "cause": "Communication between the local Sprout process and the Homestead service has been restored.",
                    "effect": "The local Sprout process can successfully contact the Homestead service.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The local Sprout process is unable to contact the Homestead service.",
                    "description": "Sprout: Homestead communication error.",
                    "cause": "The local Sprout process is unable to contact any Homestead processes. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the Homestead hostname in shared configuration, misconfiguration of the Homestead cluster DNS record, a significant network outage, or because all Homestead instances are currently failed.",
                    "effect": "This is broadly equivalent to the local Sprout having failed. If only a small percentage of Sprout processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in SIP processing capacity and will eventually result in service impacts. If all Sprout instances are failed then all future SIP registrations and call attemps will fail until such time as one or more Sprout instances recover.",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting the Homestead service. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1002,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_ASTAIRE_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Sprout process and the Astaire service has been restored.",
                    "description": "Sprout: Astaire communication error cleared.",
                    "cause": "Communication between the local Sprout process and the Astaire service has been restored.",
                    "effect": "The local Sprout process can successfully contact the Astaire service.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The local Sprout process is unable to contact the Astaire service.",
                    "description": "Sprout: Astaire communication error.",
                    "cause": "The local Sprout process is unable to contact any Astaire processes. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the Sprout registration store in shared configuration, misconfiguration of the Astaire cluster DNS record, a significant network outage, or because all Astaire instances are currently failed.",
                    "effect": "This is broadly equivalent to the local Sprout having failed. If only a small percentage of Sprout processes are failed simultaneously then in a typical deployment there will be no significant impact. However multiple simultaneous failures will result in an increasingly significant reduction in SIP processing capacity and will eventually result in service impacts. If all Sprout instances are failed then all future SIP registrations and call attemps will fail until such time as one or more Sprout instances recover.",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting the Astaire service. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1003,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_REMOTE_ASTAIRE_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The local Sprout process is able to successfully communicate with one or more Astaire processes in remote sites.",
                    "description": "Sprout: Remote Astaire communication error cleared.",
                    "cause": "The local Sprout process is able to successfully communicate with one or more remote Astaire instances.",
                    "effect": "The local Sprout process can successfully contact the remote Astaire service.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The local Sprout process is unable to contact any Astaire instances in remote sites.",
                    "description": "Sprout: Remote Astaire communication error.",
                    "cause": "The local Sprout process is unable to contact any Astaire processes in remote sites. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the remote Sprout registration store in shared configuration, misconfiguration of the Astaire cluster DNS record, a significant network outage, or because all remote Astaire instances are currently failed.",
                    "effect": "The deployment is no longer geographically redundant because the S-CSCF cannot synchronize registration data to remote sites. If subscribers switch to other geographic sites they may have to re-register before becoming operational.",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting Astaire processes in remote sites. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1004,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_CHRONOS_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Sprout process and the Chronos service has been restored.",
                    "description": "Sprout: Chronos communication error cleared.",
                    "cause": "Communication between the local Sprout process and the Chronos service has been restored.",
                    "effect": "The local Sprout process can successfully contact the Chronos service.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Sprout process is unable to contact the Chronos service.",
                    "description": "Sprout: Chronos communication error.",
                    "cause": "The local Sprout process is unable to contact any Chronos processes. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the Chronos hostname in shared configuration, misconfiguration of the Chronos cluster DNS record, a significant network outage, or because all Chronos instances are currently failed.",
                    "effect": "This failure will not cause any new requests to be rejected, but will mean that the appropriate notification messages (NOTIFYs, Server-Assignment-Requests to the HSS) will not be generated when registrations or subscriptions expire. Users will be able to re-register/re-subscribe later. From the HSS's point of view it will still regard the subscriber as registered (requests will be sent to the same S-CSCF, and unregistered services like voicemail will not be applied).",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting Chronos. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1005,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_RALF_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Sprout process and the Ralf service has been restored.",
                    "description": "Sprout: Ralf communication error cleared.",
                    "cause": "Communication between the local Sprout process and the Ralf service has been restored.",
                    "effect": "The local Sprout process can successfully contact the Ralf service.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Sprout process is unable to contact the Ralf service.",
                    "description": "Sprout: Ralf communication error.",
                    "cause": "The local Sprout process is unable to contact any Ralf processes. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the Ralf hostname in shared configuration, misconfiguration of the Ralf cluster DNS record, a significant network outage, or because all Ralf instances are currently failed.",
                    "effect": "Call detail event recording for offline billing is no longer operational for calls processed by this Sprout instance. Active calls are preserved and new calls are allowed but the service provider is no longer able to bill for the calls.",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting Ralf. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative. If this issue only impacts a small percentage of Sprout instances and cannot immediately be resolved then, if you have sufficient spare Sprout capacity in your deployment, you may wish to temporarily remove these Sprout instances from your Sprout DNS records so that transactions will be directed to Sprout instances that do still have connectivity with Ralf."
                }
            ]
        },
        {
            "index": 1006,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_ENUM_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Communication between the local Sprout process and the ENUM service has been restored.",
                    "description": "Sprout: ENUM communication error cleared.",
                    "cause": "Communication between the local Sprout process and the ENUM service has been restored.",
                    "effect": "The local Sprout process can successfully contact the ENUM service.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "The local Sprout process is unable to contact the ENUM service.",
                    "description": "Sprout: ENUM communication error.",
                    "cause": "The local Sprout process is unable to contact any ENUM servers. The likely cause depends on whether this is affecting all Sprout instances or just a subset. If the issue impacts just a subset of Sprout instances then it is likely to be due to a partial network outage or configuration issues on just those nodes. If it impacts all Sprout instances then it is likely to be due to a misconfiguration of the ENUM servers in shared configuration, misconfiguration of the ENUM DNS records, a significant network outage, or because all ENUM instances are currently failed.",
                    "effect": "Off-net calls processed by this Sprout instance will fail or be misrouted. Additionally, the I-CSCF function on this Sprout instance will be unable to make ENUM queries for tel URIs after a LIR request to the HSS has failed.",
                    "action": "Investigate the issue that is preventing the local Sprout process from contacting your ENUM servers. The Sprout process will periodically attempt to reconnect and this alarm will clear once connectivity has been restored. If you cannot determine the issue or the alarm fails to clear then contact your support representative. If this issue only impacts a small percentage of Sprout instances and cannot immediately be resolved then, if you have sufficient spare Sprout capacity in your deployment, you may wish to temporarily remove these Sprout instances from your Sprout DNS records so that transactions will be directed to Sprout instances that do still have connectivity with the ENUM service."
                }
            ]
        },
        {
            "index": 1007,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_VBUCKET_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Sprout communication to Astaire has been restored for all subscribers.",
                    "description": "Sprout: Astaire vBucket communication error cleared.",
                    "cause": "Sprout communication to Astaire has been restored for all subscribers. The previously issued alarm has been cleared.",
                    "effect": "Normal S-CSCF call processing operation has been restored for the affected subscribers.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "Sprout is unable to contact any Astaire processes for a subset of subscribers, and so some subscriber data will be unavailable. Ensure that all Astaire processes are operational and that network connectivity exists between them and Sprout.",
                    "description": "Sprout: Astaire vBucket communication error.",
                    "cause": "Sprout is unable to contact any Astaire processes for a subset of subscribers.",
                    "effect": "A subset of the subscribers can no longer register or originate and receive calls because the S-CSCF cannot access the vBucket or the replica vBucket for those subscribers.",
                    "action": "Ensure that all Astaire processes are operational and that network connectivity exists between them and Sprout. If the alarm does not clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1008,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_REMOTE_VBUCKET_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Sprout communication to the remote Astaire site has been restored for all subscribers.",
                    "description": "Sprout: Astaire remote vBucket communication error cleared.",
                    "cause": "Sprout communication to the Astaire site has been restored for all subscribers. The previously issued alarm has been cleared.",
                    "effect": "Normal S-CSCF geographic redundancy operation has been restored for the affected subscribers.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "Sprout is unable to contact any remote Astaire processes for a subset of subscribers, so some subscriber data will be unavailable. Ensure that all remote Astaire processes are operational and that network connectivity exists between them and Sprout.",
                    "description": "Sprout: Astaire remote vBucket communication error.",
                    "cause": "Sprout is unable to contact any remote Astaire processes for a subset of subscribers.",
                    "effect": "The deployment is no longer geographically redundant for a subset of subscribers because the S-CSCF cannot synchronize registration data and authentication vectors to the remote site.",
                    "action": "Ensure that all remote Astaire processes are operational and that network connectivity exists between them and Sprout. If the alarm does not clear then contact your support representative."
                }
            ]
        },
        {
            "index": 1009,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_SESS_TERMINATED_AS_COMM_ERROR",
            "levels" : [
                {
                    "severity": "CLEARED",
                    "details": "Sprout communication to all active session terminated Application Servers has been restored.",
                    "description": "Sprout: Communication error to session terminated Application Servers cleared.",
                    "cause": "Sprout communication to all active Application Servers that use session terminated iFC default handling has been restored. The previously issued alarm has been cleared. ",
                    "effect": "Normal Application Server communications have been restored.",
                    "action": "No action."
                },
                {
                    "severity": "MAJOR",
                    "details": "Sprout cannot successfully communicate with one or more Application Servers that use session terminated default handling. Check that all ASs are operational, they have network connectivity to Sprout, and iFCs are properly configured.",
                    "description": "Sprout: Communication error to session terminated Application Server.",
                    "cause": "Sprout is unable to successfully communicate with at least one active Application Server that uses session terminated iFC default handling. ",
                    "effect": "Probable major loss of service. The precise impact will vary depending on the role of Application Servers in the deployment. ",
                    "action": "Use ENT logs to identify which Application Servers cannot be successfully communicated with and investigate the cause. It might be due to failure of an AS, misconfiguration of Initial Filter Criteria, or network / DNS problems. Once the issue has been resolved this alarm will clear after approximately 5-10 minutes."
                }
            ]
        },
        {
            "index": 1010,
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "name": "SPROUT_SESS_CONTINUED_AS_COMM_ERROR",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "Sprout communication to all active session continued Application Servers has been restored",
                    "description": "Sprout: Communication error to session continued Application Servers cleared.",
                    "cause": "Sprout communication to all active Application Servers that use session continued iFC default handling has been restored. The previously issued alarm has been cleared.",
                    "effect": "Normal Application Server communications have been restored",
                    "action": "No action"
                },
                {
                    "severity": "MINOR",
                    "details": "Sprout cannot successfully communicate with one or more Application Servers that use session continued default handling. Check that all ASs are operational, they have network connectivity to Sprout, and iFCs are properly configured.",
                    "description": "Sprout: Communication error to session continued Application Server.",
                    "cause": "Sprout is unable to successfully communicate with at least one active Application Server that uses session continued iFC default handling.",
                    "effect": "The service(s) provided by this Application Server will be unavailable until communication is restored. In addition, call setup time will likely be increased for all subscribers configured to use this Application Server.",
                    "action": "Use ENT logs to identify which Application Servers cannot be successfully communicated with and investigate the cause. It might be due to failure of an AS, misconfiguration of Initial Filter Criteria, or network / DNS problems. Once the issue has been resolved this alarm will clear after approximately 5-10 minutes."
                }
            ]
        },
        {
            "index": 1011,
            "name": "SPROUT_SIFC_STATUS",
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The configuration file for shared IFCs is valid.",
                    "description": "Sprout: The configuration file for shared IFCs is valid.",
                    "cause": "The configuration file at /etc/clearwater/shared_ifcs.xml is valid.",
                    "effect": "The S-CSCF can correctly translate IDs in Service Profiles sent from the HSS into Initial Filter Criteria",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "There is at least one invalid entry in the configuration file for shared IFCs.",
                    "description": "Sprout: The configuration file for shared IFCs is invalid.",
                    "cause": "The configuration file at /etc/clearwater/shared_ifcs.xml has at least one invalid entry.",
                    "effect": "The S-CSCF will not be able to correctly translate IDs in Service Profiles sent from the HSS into Initial Filter Criteria.",
                    "action": "Correct the configuration file at /etc/clearwater/shared_ifcs.xml and upload it."
                }
            ]
        },
        {
            "index": 1012,
            "name": "SPROUT_FIFC_STATUS",
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The configuration file for fallback IFCs is valid.",
                    "description": "Sprout: The configuration file for fallback IFCs is valid.",
                    "cause": "The configuration file at /etc/clearwater/fallback_ifcs.xml is valid.",
                    "effect": "The S-CSCF will be able to correctly apply any fallback IFCs.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "There is at least one invalid entry in the configuration file for fallback IFCs.",
                    "description": "Sprout: The configuration file for fallback IFCs is invalid.",
                    "cause": "The configuration file at /etc/clearwater/fallback_ifcs.xml has at least one invalid entry.",
                    "effect": "The S-CSCF will not be able to correctly apply any fallback IFCs.",
                    "action": "Correct the configuration file at /etc/clearwater/fallback_ifcs.xml and upload it."
                }
            ]
        },
        {
            "index": 1013,
            "name": "SPROUT_RPH_STATUS",
            "cause": "UNDERLYING_RESOURCE_UNAVAILABLE",
            "levels": [
                {
                    "severity": "CLEARED",
                    "details": "The configuration file for RPH support is valid.",
                    "description": "Sprout: The configuration file for RPH support is valid.",
                    "cause": "The configuration file at /etc/clearwater/rph.json is valid.",
                    "effect": "The S-CSCF can correctly prioritize messages with the Resource-Priority header.",
                    "action": "No action."
                },
                {
                    "severity": "CRITICAL",
                    "details": "The configuration file for RPH support is either missing, or invalid.",
                    "description": "Sprout: The configuration file for RPH support is missing or invalid.",
                    "cause": "The configuration file at /etc/clearwater/rph.json is missing or has at least one invalid entry.",
                    "effect": "The S-CSCF will not be able to correctly prioritize messages with the Resource-Priority header.",
                    "action": "Correct the configuration file at /etc/clearwater/rph.json and upload it."
                }
            ]
        }
    ]
}
